Always-Testing.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-01-07 Sat 14:50 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="org.css"/>
</head>
<body>
<div id="content" class="content">
<ul class="org-ul">
<li><a href="index.html">home</a></li>
</ul>
<div id="outline-container-org59f2926" class="outline-2">
<h2 id="org59f2926">Always Testing</h2>
<div class="outline-text-2" id="text-org59f2926">
<p>
Devices sent to customers for internal penetration tests I've develeoped both a <i>kali linux</i> installation script and a <i>Debian</i> installation script filled with tools. To track the changes to these files an internal <a href="https://gitlab.com/">GitLab</a> was deployed. But like any project there are bugs, so devices that were sent for internal penetration tests were not working as expected. To try and overcome this obvious issue, I looked into the <code>CI/CD</code> process build into <a href="https://gitlab.com">GitLab</a> and was amazed. Not only would the process run the script as a job, but it will show if there was a problem. 
</p>
</div>

<div id="outline-container-orgde59cb7" class="outline-3">
<h3 id="orgde59cb7">Server Configurations</h3>
<div class="outline-text-3" id="text-orgde59cb7">
</div>
<div id="outline-container-org329737e" class="outline-4">
<h4 id="org329737e">Installation</h4>
<div class="outline-text-4" id="text-org329737e">
<p>
First the <code>gitlab-runner</code> needs to be installed. Because updates are nice installing the <code>gitlab-runner</code> repo is chosen.
</p>
<ol class="org-ol">
<li><p>
Run the install script 
</p>
<div class="org-src-container">
<pre class="src src-shell">curl -L <span style="font-style: italic;">\</span>
     https://packages.gitlab.com/install/repositories/runner/gitlab-runner/script.deb.sh | sudo bash
</pre>
</div></li>
<li><p>
Then install the <code>gitlab-runner</code> via <code>apt</code>
</p>
<div class="org-src-container">
<pre class="src src-shell">sudo apt-get install gitlab-runner -y 
</pre>
</div></li>
<li><p>
Install docker on the server
</p>
<div class="org-src-container">
<pre class="src src-shell">curl -fsSL get.docker.com -o get-docker.sh &amp;&amp; <span style="font-style: italic;">\</span>
    sudo bash ./get-docker.sh
</pre>
</div></li>
</ol>
</div>
</div>
<div id="outline-container-org401f605" class="outline-4">
<h4 id="org401f605">Deploying a Runner</h4>
<div class="outline-text-4" id="text-org401f605">
<p>
A runner is now needed for the project(s) that you want to test a build of. When I first done this the runner would have the status of <i>stuck</i>, A bit of googling around and I discovered this command.
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="font-weight: bold; font-style: italic;">REGISTER_LOCKED</span>=false <span style="font-style: italic;">\</span>
               gitlab-runner <span style="font-style: italic;">\</span>
               register <span style="font-style: italic;">\</span>
               --non-interactive <span style="font-style: italic;">\</span>
               --url $<span style="font-weight: bold; font-style: italic;">URL</span> <span style="font-style: italic;">\</span>
               --registration-token $<span style="font-weight: bold; font-style: italic;">TOKEN</span> <span style="font-style: italic;">\</span>
               --executor docker <span style="font-style: italic;">\</span>
               --docker-image debian
</pre>
</div>
<p>
Replace <code>$URL</code> and <code>$TOKEN</code> with the values shown under the runner settings of the project.
</p>
</div>
</div>
</div>

<div id="outline-container-orge9ad849" class="outline-3">
<h3 id="orge9ad849">Project Configurations</h3>
<div class="outline-text-3" id="text-orge9ad849">
<p>
For the runner to know what to run for the project a <code>.gitlab-ci.yml</code> file is needed in the project root. Populate that file to represent the commands to test your installation script. Mine looks like this.
</p>
<pre class="example" id="org4c58a27">
before_script:
  - apt-get update -qq &amp;&amp; apt-get upgrade -y &amp;&amp; apt-get -qq install lsb-release wget -y

offensive-debian:
  image: debian
  script:
   - bash ./setup/debian.sh full

kalilinux:
  image: kalilinux/kali-linux-docker
  script:
  - bash ./setup/kali.sh
</pre>

<p>
Now on the next commit your job <i>should</i> run and your see the output in the <code>CI/CD</code> options for the project.
</p>
</div>
</div>
</div>
</div>
</body>
</html>
